module.exports = {
  createUser: 'Переданы некорректные данные при создании пользователя',
  updateProfile: 'Переданы некорректные данные при обновлении профиля',
  createMovie: 'Переданы некорректные данные при создании фильма',
  userNotFound: 'Пользователь с указанным _id не найден',
  movieNotFound: 'Фильм с указанным _id не найден',
  pageNotFound: 'Страница не найдена',
  emailIncorrect: 'Введён некорректный email-адрес',
  unauthorized: 'Неправильная почта или пароль',
  needAuthorize: 'Необходима авторизация',
  conflict: 'Пользователь с таким E-mail уже зарегистрирован',
  linkIncorrect: 'Введена некорректная ссылка',
  forbidden: 'Недостаточно прав',
};
